; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/floortile/domain.pddl
;; updates:
;;   - :action-costs removed
;;   - movements updated to move_* to avoid repeating action and predicate names, e.g., up pred. with up act.
;;   - all action names use underscore

(define (domain floortile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates
    (robot-at ?r - robot ?x - tile)
    (up ?x - tile ?y - tile)
    (down ?x - tile ?y - tile)
    (right ?x - tile ?y - tile)
    (left ?x - tile ?y - tile)
    (clear ?x - tile)
    (painted ?x - tile ?c - color)
    (robot-has ?r - robot ?c - color)
    (available-color ?c - color)
    (free-color ?r - robot))

(:action change_color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
)

(:action paint_up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

(:action paint_down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

; Robot movements
(:action move_up
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_down
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_right
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_left
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

)

; problem
;; rows=9, columns=3, robots=2, out_folder=training/easy, instance_id=69, seed=94

(define (problem floortile-69)
 (:domain floortile)
 (:objects 
    tile_0_1
    tile_0_2
    tile_0_3
    tile_1_1
    tile_1_2
    tile_1_3
    tile_2_1
    tile_2_2
    tile_2_3
    tile_3_1
    tile_3_2
    tile_3_3
    tile_4_1
    tile_4_2
    tile_4_3
    tile_5_1
    tile_5_2
    tile_5_3
    tile_6_1
    tile_6_2
    tile_6_3
    tile_7_1
    tile_7_2
    tile_7_3
    tile_8_1
    tile_8_2
    tile_8_3
    tile_9_1
    tile_9_2
    tile_9_3 - tile
    robot1
    robot2 - robot
    white black - color
)
 (:init 
    (robot-at robot1 tile_1_2)
    (robot-has robot1 black)
    (robot-at robot2 tile_4_1)
    (robot-has robot2 black)
    (available-color white)
    (available-color black)
    (clear tile_0_1)
    (clear tile_0_2)
    (clear tile_0_3)
    (clear tile_1_1)
    (clear tile_1_3)
    (clear tile_2_1)
    (clear tile_2_2)
    (clear tile_2_3)
    (clear tile_3_1)
    (clear tile_3_2)
    (clear tile_3_3)
    (clear tile_4_2)
    (clear tile_4_3)
    (clear tile_5_1)
    (clear tile_5_2)
    (clear tile_5_3)
    (clear tile_6_1)
    (clear tile_6_2)
    (clear tile_6_3)
    (clear tile_7_1)
    (clear tile_7_2)
    (clear tile_7_3)
    (clear tile_8_1)
    (clear tile_8_2)
    (clear tile_8_3)
    (clear tile_9_1)
    (clear tile_9_2)
    (clear tile_9_3)
    (up tile_1_1 tile_0_1 )
    (up tile_1_2 tile_0_2 )
    (up tile_1_3 tile_0_3 )
    (up tile_2_1 tile_1_1 )
    (up tile_2_2 tile_1_2 )
    (up tile_2_3 tile_1_3 )
    (up tile_3_1 tile_2_1 )
    (up tile_3_2 tile_2_2 )
    (up tile_3_3 tile_2_3 )
    (up tile_4_1 tile_3_1 )
    (up tile_4_2 tile_3_2 )
    (up tile_4_3 tile_3_3 )
    (up tile_5_1 tile_4_1 )
    (up tile_5_2 tile_4_2 )
    (up tile_5_3 tile_4_3 )
    (up tile_6_1 tile_5_1 )
    (up tile_6_2 tile_5_2 )
    (up tile_6_3 tile_5_3 )
    (up tile_7_1 tile_6_1 )
    (up tile_7_2 tile_6_2 )
    (up tile_7_3 tile_6_3 )
    (up tile_8_1 tile_7_1 )
    (up tile_8_2 tile_7_2 )
    (up tile_8_3 tile_7_3 )
    (up tile_9_1 tile_8_1 )
    (up tile_9_2 tile_8_2 )
    (up tile_9_3 tile_8_3 )
    (down tile_0_1 tile_1_1 )
    (down tile_0_2 tile_1_2 )
    (down tile_0_3 tile_1_3 )
    (down tile_1_1 tile_2_1 )
    (down tile_1_2 tile_2_2 )
    (down tile_1_3 tile_2_3 )
    (down tile_2_1 tile_3_1 )
    (down tile_2_2 tile_3_2 )
    (down tile_2_3 tile_3_3 )
    (down tile_3_1 tile_4_1 )
    (down tile_3_2 tile_4_2 )
    (down tile_3_3 tile_4_3 )
    (down tile_4_1 tile_5_1 )
    (down tile_4_2 tile_5_2 )
    (down tile_4_3 tile_5_3 )
    (down tile_5_1 tile_6_1 )
    (down tile_5_2 tile_6_2 )
    (down tile_5_3 tile_6_3 )
    (down tile_6_1 tile_7_1 )
    (down tile_6_2 tile_7_2 )
    (down tile_6_3 tile_7_3 )
    (down tile_7_1 tile_8_1 )
    (down tile_7_2 tile_8_2 )
    (down tile_7_3 tile_8_3 )
    (down tile_8_1 tile_9_1 )
    (down tile_8_2 tile_9_2 )
    (down tile_8_3 tile_9_3 )
    (left tile_0_1 tile_0_2 )
    (left tile_0_2 tile_0_3 )
    (left tile_1_1 tile_1_2 )
    (left tile_1_2 tile_1_3 )
    (left tile_2_1 tile_2_2 )
    (left tile_2_2 tile_2_3 )
    (left tile_3_1 tile_3_2 )
    (left tile_3_2 tile_3_3 )
    (left tile_4_1 tile_4_2 )
    (left tile_4_2 tile_4_3 )
    (left tile_5_1 tile_5_2 )
    (left tile_5_2 tile_5_3 )
    (left tile_6_1 tile_6_2 )
    (left tile_6_2 tile_6_3 )
    (left tile_7_1 tile_7_2 )
    (left tile_7_2 tile_7_3 )
    (left tile_8_1 tile_8_2 )
    (left tile_8_2 tile_8_3 )
    (left tile_9_1 tile_9_2 )
    (left tile_9_2 tile_9_3 )
    (right tile_0_2 tile_0_1 )
    (right tile_0_3 tile_0_2 )
    (right tile_1_2 tile_1_1 )
    (right tile_1_3 tile_1_2 )
    (right tile_2_2 tile_2_1 )
    (right tile_2_3 tile_2_2 )
    (right tile_3_2 tile_3_1 )
    (right tile_3_3 tile_3_2 )
    (right tile_4_2 tile_4_1 )
    (right tile_4_3 tile_4_2 )
    (right tile_5_2 tile_5_1 )
    (right tile_5_3 tile_5_2 )
    (right tile_6_2 tile_6_1 )
    (right tile_6_3 tile_6_2 )
    (right tile_7_2 tile_7_1 )
    (right tile_7_3 tile_7_2 )
    (right tile_8_2 tile_8_1 )
    (right tile_8_3 tile_8_2 )
    (right tile_9_2 tile_9_1 )
    (right tile_9_3 tile_9_2 ))
 (:goal  (and 
    (painted tile_1_1 white)
    (painted tile_1_2 black)
    (painted tile_1_3 white)
    (painted tile_2_1 black)
    (painted tile_2_2 white)
    (painted tile_2_3 black)
    (painted tile_3_1 white)
    (painted tile_3_2 black)
    (painted tile_3_3 white)
    (painted tile_4_1 black)
    (painted tile_4_2 white)
    (painted tile_4_3 black)
    (painted tile_5_1 white)
    (painted tile_5_2 black)
    (painted tile_5_3 white)
    (painted tile_6_1 black)
    (painted tile_6_2 white)
    (painted tile_6_3 black)
    (painted tile_7_1 white)
    (painted tile_7_2 black)
    (painted tile_7_3 white)
    (painted tile_8_1 black)
    (painted tile_8_2 white)
    (painted tile_8_3 black)
    (painted tile_9_1 white)
    (painted tile_9_2 black)
    (painted tile_9_3 white))))

; plan
1. (move_up robot2 tile_4_1 tile_5_1)
   deleted: (robot-at robot2 tile_4_1) (clear tile_5_1)
   added: (robot-at robot2 tile_5_1) (clear tile_4_1)
   goals met: 0 of 27
2. (move_up robot2 tile_5_1 tile_6_1)
   deleted: (robot-at robot2 tile_5_1) (clear tile_6_1)
   added: (robot-at robot2 tile_6_1) (clear tile_5_1)
   goals met: 0 of 27
3. (move_up robot2 tile_6_1 tile_7_1)
   deleted: (robot-at robot2 tile_6_1) (clear tile_7_1)
   added: (robot-at robot2 tile_7_1) (clear tile_6_1)
   goals met: 0 of 27
4. (move_up robot2 tile_7_1 tile_8_1)
   deleted: (robot-at robot2 tile_7_1) (clear tile_8_1)
   added: (robot-at robot2 tile_8_1) (clear tile_7_1)
   goals met: 0 of 27
5. (move_right robot2 tile_8_1 tile_8_2)
   deleted: (robot-at robot2 tile_8_1) (clear tile_8_2)
   added: (robot-at robot2 tile_8_2) (clear tile_8_1)
   goals met: 0 of 27
6. (paint_up robot2 tile_9_2 tile_8_2 black)
   deleted: (clear tile_9_2)
   added: (painted tile_9_2 black)
   goals met: 1 of 27
7. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 1 of 27
8. (move_right robot2 tile_8_2 tile_8_3)
   deleted: (robot-at robot2 tile_8_2) (clear tile_8_3)
   added: (robot-at robot2 tile_8_3) (clear tile_8_2)
   goals met: 1 of 27
9. (paint_up robot2 tile_9_3 tile_8_3 white)
   deleted: (clear tile_9_3)
   added: (painted tile_9_3 white)
   goals met: 2 of 27
10. (move_left robot2 tile_8_3 tile_8_2)
   deleted: (robot-at robot2 tile_8_3) (clear tile_8_2)
   added: (robot-at robot2 tile_8_2) (clear tile_8_3)
   goals met: 2 of 27
11. (move_left robot2 tile_8_2 tile_8_1)
   deleted: (robot-at robot2 tile_8_2) (clear tile_8_1)
   added: (robot-at robot2 tile_8_1) (clear tile_8_2)
   goals met: 2 of 27
12. (paint_up robot2 tile_9_1 tile_8_1 white)
   deleted: (clear tile_9_1)
   added: (painted tile_9_1 white)
   goals met: 3 of 27
13. (move_down robot2 tile_8_1 tile_7_1)
   deleted: (robot-at robot2 tile_8_1) (clear tile_7_1)
   added: (robot-at robot2 tile_7_1) (clear tile_8_1)
   goals met: 3 of 27
14. (move_right robot2 tile_7_1 tile_7_2)
   deleted: (robot-at robot2 tile_7_1) (clear tile_7_2)
   added: (robot-at robot2 tile_7_2) (clear tile_7_1)
   goals met: 3 of 27
15. (paint_up robot2 tile_8_2 tile_7_2 white)
   deleted: (clear tile_8_2)
   added: (painted tile_8_2 white)
   goals met: 4 of 27
16. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 4 of 27
17. (move_left robot2 tile_7_2 tile_7_1)
   deleted: (robot-at robot2 tile_7_2) (clear tile_7_1)
   added: (robot-at robot2 tile_7_1) (clear tile_7_2)
   goals met: 4 of 27
18. (paint_up robot2 tile_8_1 tile_7_1 black)
   deleted: (clear tile_8_1)
   added: (painted tile_8_1 black)
   goals met: 5 of 27
19. (move_down robot2 tile_7_1 tile_6_1)
   deleted: (robot-at robot2 tile_7_1) (clear tile_6_1)
   added: (robot-at robot2 tile_6_1) (clear tile_7_1)
   goals met: 5 of 27
20. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 5 of 27
21. (paint_up robot2 tile_7_1 tile_6_1 white)
   deleted: (clear tile_7_1)
   added: (painted tile_7_1 white)
   goals met: 6 of 27
22. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 6 of 27
23. (move_right robot2 tile_6_1 tile_6_2)
   deleted: (robot-at robot2 tile_6_1) (clear tile_6_2)
   added: (robot-at robot2 tile_6_2) (clear tile_6_1)
   goals met: 6 of 27
24. (paint_up robot2 tile_7_2 tile_6_2 black)
   deleted: (clear tile_7_2)
   added: (painted tile_7_2 black)
   goals met: 7 of 27
25. (move_right robot2 tile_6_2 tile_6_3)
   deleted: (robot-at robot2 tile_6_2) (clear tile_6_3)
   added: (robot-at robot2 tile_6_3) (clear tile_6_2)
   goals met: 7 of 27
26. (move_up robot2 tile_6_3 tile_7_3)
   deleted: (robot-at robot2 tile_6_3) (clear tile_7_3)
   added: (robot-at robot2 tile_7_3) (clear tile_6_3)
   goals met: 7 of 27
27. (paint_up robot2 tile_8_3 tile_7_3 black)
   deleted: (clear tile_8_3)
   added: (painted tile_8_3 black)
   goals met: 8 of 27
28. (move_down robot2 tile_7_3 tile_6_3)
   deleted: (robot-at robot2 tile_7_3) (clear tile_6_3)
   added: (robot-at robot2 tile_6_3) (clear tile_7_3)
   goals met: 8 of 27
29. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 8 of 27
30. (paint_up robot2 tile_7_3 tile_6_3 white)
   deleted: (clear tile_7_3)
   added: (painted tile_7_3 white)
   goals met: 9 of 27
31. (move_down robot2 tile_6_3 tile_5_3)
   deleted: (robot-at robot2 tile_6_3) (clear tile_5_3)
   added: (robot-at robot2 tile_5_3) (clear tile_6_3)
   goals met: 9 of 27
32. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 9 of 27
33. (paint_up robot2 tile_6_3 tile_5_3 black)
   deleted: (clear tile_6_3)
   added: (painted tile_6_3 black)
   goals met: 10 of 27
34. (move_left robot2 tile_5_3 tile_5_2)
   deleted: (robot-at robot2 tile_5_3) (clear tile_5_2)
   added: (robot-at robot2 tile_5_2) (clear tile_5_3)
   goals met: 10 of 27
35. (move_left robot2 tile_5_2 tile_5_1)
   deleted: (robot-at robot2 tile_5_2) (clear tile_5_1)
   added: (robot-at robot2 tile_5_1) (clear tile_5_2)
   goals met: 10 of 27
36. (paint_up robot2 tile_6_1 tile_5_1 black)
   deleted: (clear tile_6_1)
   added: (painted tile_6_1 black)
   goals met: 11 of 27
37. (move_right robot2 tile_5_1 tile_5_2)
   deleted: (robot-at robot2 tile_5_1) (clear tile_5_2)
   added: (robot-at robot2 tile_5_2) (clear tile_5_1)
   goals met: 11 of 27
38. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 11 of 27
39. (paint_up robot2 tile_6_2 tile_5_2 white)
   deleted: (clear tile_6_2)
   added: (painted tile_6_2 white)
   goals met: 12 of 27
40. (move_down robot2 tile_5_2 tile_4_2)
   deleted: (robot-at robot2 tile_5_2) (clear tile_4_2)
   added: (robot-at robot2 tile_4_2) (clear tile_5_2)
   goals met: 12 of 27
41. (move_left robot2 tile_4_2 tile_4_1)
   deleted: (robot-at robot2 tile_4_2) (clear tile_4_1)
   added: (robot-at robot2 tile_4_1) (clear tile_4_2)
   goals met: 12 of 27
42. (paint_up robot2 tile_5_1 tile_4_1 white)
   deleted: (clear tile_5_1)
   added: (painted tile_5_1 white)
   goals met: 13 of 27
43. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 13 of 27
44. (move_down robot2 tile_4_1 tile_3_1)
   deleted: (robot-at robot2 tile_4_1) (clear tile_3_1)
   added: (robot-at robot2 tile_3_1) (clear tile_4_1)
   goals met: 13 of 27
45. (paint_up robot2 tile_4_1 tile_3_1 black)
   deleted: (clear tile_4_1)
   added: (painted tile_4_1 black)
   goals met: 14 of 27
46. (move_right robot2 tile_3_1 tile_3_2)
   deleted: (robot-at robot2 tile_3_1) (clear tile_3_2)
   added: (robot-at robot2 tile_3_2) (clear tile_3_1)
   goals met: 14 of 27
47. (move_up robot2 tile_3_2 tile_4_2)
   deleted: (robot-at robot2 tile_3_2) (clear tile_4_2)
   added: (robot-at robot2 tile_4_2) (clear tile_3_2)
   goals met: 14 of 27
48. (paint_up robot2 tile_5_2 tile_4_2 black)
   deleted: (clear tile_5_2)
   added: (painted tile_5_2 black)
   goals met: 15 of 27
49. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 15 of 27
50. (move_right robot2 tile_4_2 tile_4_3)
   deleted: (robot-at robot2 tile_4_2) (clear tile_4_3)
   added: (robot-at robot2 tile_4_3) (clear tile_4_2)
   goals met: 15 of 27
51. (paint_up robot2 tile_5_3 tile_4_3 white)
   deleted: (clear tile_5_3)
   added: (painted tile_5_3 white)
   goals met: 16 of 27
52. (move_down robot2 tile_4_3 tile_3_3)
   deleted: (robot-at robot2 tile_4_3) (clear tile_3_3)
   added: (robot-at robot2 tile_3_3) (clear tile_4_3)
   goals met: 16 of 27
53. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 16 of 27
54. (paint_up robot2 tile_4_3 tile_3_3 black)
   deleted: (clear tile_4_3)
   added: (painted tile_4_3 black)
   goals met: 17 of 27
55. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 17 of 27
56. (move_down robot2 tile_3_3 tile_2_3)
   deleted: (robot-at robot2 tile_3_3) (clear tile_2_3)
   added: (robot-at robot2 tile_2_3) (clear tile_3_3)
   goals met: 17 of 27
57. (paint_up robot2 tile_3_3 tile_2_3 white)
   deleted: (clear tile_3_3)
   added: (painted tile_3_3 white)
   goals met: 18 of 27
58. (move_right robot1 tile_1_2 tile_1_3)
   deleted: (robot-at robot1 tile_1_2) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_1_2)
   goals met: 18 of 27
59. (move_left robot2 tile_2_3 tile_2_2)
   deleted: (robot-at robot2 tile_2_3) (clear tile_2_2)
   added: (robot-at robot2 tile_2_2) (clear tile_2_3)
   goals met: 18 of 27
60. (paint_up robot1 tile_2_3 tile_1_3 black)
   deleted: (clear tile_2_3)
   added: (painted tile_2_3 black)
   goals met: 19 of 27
61. (move_down robot1 tile_1_3 tile_0_3)
   deleted: (robot-at robot1 tile_1_3) (clear tile_0_3)
   added: (robot-at robot1 tile_0_3) (clear tile_1_3)
   goals met: 19 of 27
62. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 19 of 27
63. (paint_up robot1 tile_1_3 tile_0_3 white)
   deleted: (clear tile_1_3)
   added: (painted tile_1_3 white)
   goals met: 20 of 27
64. (move_left robot1 tile_0_3 tile_0_2)
   deleted: (robot-at robot1 tile_0_3) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_0_3)
   goals met: 20 of 27
65. (move_up robot2 tile_2_2 tile_3_2)
   deleted: (robot-at robot2 tile_2_2) (clear tile_3_2)
   added: (robot-at robot2 tile_3_2) (clear tile_2_2)
   goals met: 20 of 27
66. (paint_up robot2 tile_4_2 tile_3_2 white)
   deleted: (clear tile_4_2)
   added: (painted tile_4_2 white)
   goals met: 21 of 27
67. (move_down robot2 tile_3_2 tile_2_2)
   deleted: (robot-at robot2 tile_3_2) (clear tile_2_2)
   added: (robot-at robot2 tile_2_2) (clear tile_3_2)
   goals met: 21 of 27
68. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 21 of 27
69. (paint_up robot2 tile_3_2 tile_2_2 black)
   deleted: (clear tile_3_2)
   added: (painted tile_3_2 black)
   goals met: 22 of 27
70. (move_left robot2 tile_2_2 tile_2_1)
   deleted: (robot-at robot2 tile_2_2) (clear tile_2_1)
   added: (robot-at robot2 tile_2_1) (clear tile_2_2)
   goals met: 22 of 27
71. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 22 of 27
72. (paint_up robot2 tile_3_1 tile_2_1 white)
   deleted: (clear tile_3_1)
   added: (painted tile_3_1 white)
   goals met: 23 of 27
73. (move_down robot2 tile_2_1 tile_1_1)
   deleted: (robot-at robot2 tile_2_1) (clear tile_1_1)
   added: (robot-at robot2 tile_1_1) (clear tile_2_1)
   goals met: 23 of 27
74. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 23 of 27
75. (paint_up robot2 tile_2_1 tile_1_1 black)
   deleted: (clear tile_2_1)
   added: (painted tile_2_1 black)
   goals met: 24 of 27
76. (move_up robot1 tile_0_2 tile_1_2)
   deleted: (robot-at robot1 tile_0_2) (clear tile_1_2)
   added: (robot-at robot1 tile_1_2) (clear tile_0_2)
   goals met: 24 of 27
77. (paint_up robot1 tile_2_2 tile_1_2 white)
   deleted: (clear tile_2_2)
   added: (painted tile_2_2 white)
   goals met: 25 of 27
78. (move_down robot1 tile_1_2 tile_0_2)
   deleted: (robot-at robot1 tile_1_2) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_1_2)
   goals met: 25 of 27
79. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 25 of 27
80. (paint_up robot1 tile_1_2 tile_0_2 black)
   deleted: (clear tile_1_2)
   added: (painted tile_1_2 black)
   goals met: 26 of 27
81. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 26 of 27
82. (move_down robot2 tile_1_1 tile_0_1)
   deleted: (robot-at robot2 tile_1_1) (clear tile_0_1)
   added: (robot-at robot2 tile_0_1) (clear tile_1_1)
   goals met: 26 of 27
83. (paint_up robot2 tile_1_1 tile_0_1 white)
   deleted: (clear tile_1_1)
   added: (painted tile_1_1 white)
   goals met: 27 of 27
